perf/scenarios/stress-testing/space-news.yaml
config:
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: "artillery-api"

  environments:
    base-case:
      target: "http://localhost:5555/api/space_news"
    cache:
      target: "http://localhost:5555/api/space_news?cache=true"
    replication:
      target: "http://localhost:5555/replicated_api/space_news"
    rate-limiting:
      target: "http://localhost:5555/api/limited/space_news"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # TODO: Evaluar si con aún más usuarios hay caida del servicio
  phases:
    - name: warm-up
      duration: 45
      arrivalRate: 100
    - name: ramp-up
      duration: 45
      arrivalRate: 10
      rampTo: 300
    - name: plain
      duration: 90
      arrivalRate: 500

scenarios:
  - name: Space news - Root (/)
    flow:
      - get:
          url: "/"